# 예제 1 

# print("Hello Python")
# print("Hello!" * 3)
# print("혼자 공부하다 모르면 동영상 강의를 참고하세요!")

# print( 1 > 3 )
# print( 10 > 3 )

# print(True)
# print(False)
# print(not True)
# print(not (5>10))

# # 따옴표 내에 있는 것은 문자열로 인식 -> 따옴표 안에서 연산식을 넣어도 계산된 결과가 아닌 그대로 나옴.

# # print("1+3")
# print(100) # 숫자를 쓸 때는 이대로
# print("100") # 문자열로 표현할 때는 이렇게 변형

# %d 는 정수형으로 변경하는 것으로 뒤에 작성될 %에 있는 수를 변형하면 된다. 
# print("숫자는 %d"%200)
# print("숫자는 %d"%200)
# print("%d"%300)
# print("%d+%d=%d"%(2,5,2+5))

# # %d 작성 시 형태는 상관없으나 따옴표 뒤에 %d를 붙일 때에는 동일한 수와 형태로 작성

# # print("%d * %d = %d"%(3,4,3*4))
# print("%6d"%20) #d앞에 숫자를 쓰면 해당 자리수의 띄어쓰기가 된다. 뒤에 쓴 글자가 1의 자리부터 되도록.
# print("%09d"%20000) # d앞에 0을 붙이고 다른 수를 쓰면 뒤에 있는 숫자만큼의 자리수를 만들고 부족한 앞자리는 0으로 채워짐.
# # %d : 실수 // %f : 실수 // %s : 문자열

# print("%f"%12.35)
# print("%7.1f"%123.45) # 7자리 수로 만들어 주고, 소수점 뒷자리는 하나만 남겨라. 앞은 공백으로 표현.
# print("%07.1f"%123.45) # 위와 동일하나 앞을 0으로 채우게 됨.
# print("%07.3f"%123.45) # 총 7자리 수로 표현, 빈 공백은 0으로 채우고 소수점 이하 세자리로 작성.

# print("%.2f"%12.3456) # 자리수는 상관없음. 소수점 둘째 자리까지만 표현, 뒤에 0 안 붙음. 자동 반올림.

# print("안녕하세요")
# print("%s"%"안녕하세요") # 뒤에도 무조건 따옴표 달아줘야 한다. 

# 예제 2
print("%.2f" %758.12345678)

print("%010.2f" %25.05)

print("%d" %150.15)
print("%f" %150.15)
print("%s" %"150.15")

print("*" * 10)