# # 전일 복습 예제 1) 사칙연산

# n1 = int(input("첫번째 숫자를 입력해주세요 >>"))
# n2 = int(input("두번째 숫자를 입력해주세요 >>"))
# print("{} {} {}".format(n1/n2,n1//n2,n1%n1))

# s1 = '100'
# s2= '100.123'
# s3 = '99.9'

# s1,s2,s3 = int(s1),float(s2),float(s3)
# print('합은 {}입니다.'.format(s1+s2+s3))

# # 전일 복습 예제 2) 조건문 if

# 키가 130cm 이상만 놀이기구를 탑승할 수 있다. 
# height = 160
# if height < 130 :
#     print("이 놀이기구를 탑승할 수 없습니다.")
# else :
#     print("놀이기구를 탑승할 수 있습니다.")
    
# # 나이가 10살 이상이고 키가 130cm 이상만 놀이기구에 탑승할 수 있다. 
# h = 120
# a = 11

# if h >= 130 and a >= 10 :
#     print("놀이기구에 탑승할 수 있습니다.")
# else :
#     print("이 놀이기구에 탑승할 수 없습니다.")
    
# # 비가 오면 '우산을 챙겨주세요' // 아니면 '선크림을 발라주세요'
# weather= '비'

# if weather == '비' :
#     print("우산을 챙겨주세요!")
# else :
#     print("선크림을 발라주세요!")
    
# # 비나 눈이 오면 '우산을 챙겨주세요' // 아니면 '선크림을 발라주세요'
# weather = '맑음'
# if weather == '비' or weather ==  '눈' :
#     print("우산을 챙겨주세요!")
# else :
#     print("선크림을 발라주세요!")