# 조건문 if / elif / else 활용
'''
if 조건문1 :
    실행문 1
elif 조건문 2 :
    실행문 2
else :
    실행문 3
    
조건문 1이 참이면 실행문1 실행 후 종료
조건문 2가 거짓이고 조건문 2가 참이면 실행문 2 실행 후 종료
조건문 1,2가 모두 거짓이면 실행문 3 실행 후 종료
'''

# ex)
# weather = '맑음'
# if weather == '비' :
#     print("비가 내리니 우산을 지참하세요.")
# elif weather == '눈' :
#     print("폭설에 주의하세요.")
# else :
#     print("선크림을 지참하세요.")

# 예제 1
# 변수가 양수이면 양수, 음수이면 음수로 출력, 0이면 0이라고 출력하라.

num = int(input("숫자를 입력해주세요 >>"))
if num > 0 :
    print("입력하신 숫자는 양수입니다.")
elif num == 0 :
    print("입력하신 수는 0입니다.")
else :
    print("입력하신 숫자는 음수입니다.")

# 예제 2)
# 돈이 만원 이상이면 택시, 이천원 이상 버스, 천원 이상 따릉이, 나머지 도보
money = int(input("잔액을 입력해주세요 >>"))
if money > 10000 :
    print("택시 이용이 가능합니다.")
elif 10000 > money >= 2000 :
    print("대중교통을 이용하시길 바랍니다.")
elif 2000 > money >= 1000 :
    print("따릉이를 이용하시길 바랍니다.")
else :
    print("도보로 이용하시길 바랍니다.")