# 중첩 조건문 
# a = 97
# if a > 90 :
#     print("90보다 큽니다.")
# else :
#     print("90보다 작습니다.")
    
# if a > 90 :
#     if a < 95 :
#         print("90보다 크고 95보다 작습니다.")
#     else :
#         print('95보다 큽니다.')
# else :
#     print("90보다 작습니다.")
    
#  만약 사과의 상태가 good 이며 1000원 이하면 '10개 구매'
#  1000원보다 비싸면 '3개 구매' , 사과의 상태가 good이 아니면 '사과를 구매하지 않습니다.'
# a = 'good'
# p = 500

# if a == 'good' :
#     if p <= 1000 :
#         print("사과를 10개 구매합니다.")
#     else :
#         print("사과를 3개 구매합니다. ")
# else :
#     print("사과를 구매하지 않습니다.")

#  숫자를 입력받아 100보다 큰 수면서 짝수면 짝수, 홀수면 홀수 출력 // 100보다 작은 경우 100보다 작다
# num = int(input("숫자를 입력하세요 >>"))
# if num >= 100 :
#     if num % 2 == 0:
#         print("입력하신 숫자는 짝수입니다.")
#     else :
#         print("입력하신 숫자는 홀수입니다.")
# else :
#     print("입력하신 숫자는 100보다 작은 수입니다.")

