#  Day 3 복습
#  변수 - bool형, 문자열, 정수형, 실수형 + []리스트 형태 모두 가능//

#  변수 출력 - 변수를 지정하여 출력 or 수식(format 형태)을 사용하여도 가능.

#  관계연산자 - >,<,=   // >=,<=    // ==, !=

#  논리연산자 - and(둘 다 참이어야 참,아님 거짓) / 
#  or(둘 중 하나라도 참이면 참, 전부 거짓일 때만 거짓) / not(참->거짓, 거짓->참) 

#  조건문 if - if->elif->else 순으로 진행되며 elif 사용 시 앞선 if가 거짓일 때 넘어가서 실행
#  조건문 작성 시 콜론 꼭 붙여야 함, 조건이 겹치지 않게 주의, 들여쓰기 확인.
#    + 실행문을 비워놓고 싶을 때는 pass 작성? -> 조건문 뒤에 print() 대신 pass 작성
#      if 1 == 1 : \t pass 작성하면 조건문이 참일 때 공란으로 작성됨.

#  중첩 조건문(중첩 if문) - 최초 조건문이 참인 경우에 추가적인 조건을 부여할 때 사용