#  list 형태 - 묶음 데이터 (숫자, 문자 포함 가능)

# index - list 검색, 접근 -> 리스트 내에서 0부터 시작하여 순서를 확인 후 검색 가능
#  ex) list1 = [2,5,6,9,45,41] -> [0,1,2,3,4,5] 순서로 확인가능//반대로는 -1부터 시작
#  인덱스 사용해서 리스트 특정 요소 값을 수정 가능 
#                                       ->  list1[1] = [20] -> list1의 index[1]위치 값 변경

# 리스트 내 두 가지 리스트 생성 후 그 속에서 추출 가능
#  -> list = ['짝수', '[2,4,6],'홀수', [1,3,5]] => list[1][1](리스트 내 index1 속 index1 추출)

#  리스트 슬라이싱 - 리스트 내 몇번째 인덱스부터 몇번째 인덱스까지 추출
#  list = [0,1,2,3,4,5,6]  => print(list[1:5]) <- index 1번부터 5번 전까지
#                             print(list[1:])  <- index 1번부터 끝까지
#                             print(list[:5])  <- 처음부터 index 5번 전까지

#  len ->  리스트 길이 => print(len(list))

# 특정요소 삭제 -> list = [100,200,300,400,500] => del(list[2]) * del함수 사용, 인덱스명 작성
#                                                 del(list[:2]) * 슬라이싱도 사용 가능

# 리스트 값 추가 -> append => list.append(600)  -> list = [100,200,300,400,500,600]
# 리스트 값 삭제 -> remove => list.rempve(200)  -> list = [100,300,400,500,600]

# 요소 확인 -> in // not in     => print(100 in list) or print(900 not in list)
# ex) fruit = ['사과','딸기','포도','참외','수박'] => print('홍시' in list)
#  => if '귤' in list : \t print("'귤'이 있습니다.") \t else : \t print("'귤'이 없습니다.")
