# 숫자를 입력받아 100보다 크거나 같으면 100보다 크거나 같습니다. 
#  아니면 100보다 작습니다를 출력하라/

# num = int(input("숫자를 입력하시오 >>"))
# if num >= 100 :
#     print("(100보다 크거나 같습니다.)")
# else :
#     print("(100보다 작습니다.)")
    
# num = int(input("원하시는 숫자를 입력하시오 >>"))
# if num%2 == 0 :
#     print("짝수입니다.")
# else :
#     print("홀수입니다.")

#  60점 이상이면 합격, 60점 미만일 경우 불합격으로 출력하라.

# num = int(input("획득한 점수를 입력하시오 >>"))
# if num >= 60 :
#     print("합격입니다.")
# else :
#     print("불합격입니다.")
    
# a = int(input("수를 입력하시오 >>"))
# if 5 < a <10 :
#     print("5보다 크고 10보다 작은 수입니다.")
# else :
#     print("해당 범위에 포함되지 않는 수입니다.")

# 3의 배수인지 아닌지 출력하라.
# num = int(input("숫자를 입력하세요 >>"))
# if num % 3 == 0 :
#     print("입력하신 숫자는 3의 배수입니다.")
# else :
#     print("입력하신 숫자는 3의 배수가 아닙니다.")

# num = int(input("숫자를 입력하시오 >>"))
# if num % 2 == 0 & num % 3 == 0 :
#     print("입력하신 숫자는 2의 배수이면서 동시에 3의 배수입니다.") 
# else :
#     print("입력하신 숫자는 해당 조건에 충족하지 못하는 수입니다.")