#  동전교환 프로그램 생성
# money= int(input("교환할 돈을 입력하시오 >>"))
# c500 = money//500
# c100 = (money%500)//100
# c50 = ((money%500)%100)//50
# c10 = (((money%500)%100)%50)//10

# print("입력한 금액 : {}".format(money))
# print("500원 : {}".format(c500))
# print("100원 : {}".format(c100))
# print("50원 : {}".format(c50))
# print("10원 : {}".format(c10))

# 예시 1) 지폐교환 프로그램 생성
# m = int(input("교환할 금액을 입력하시오 >>"))
# p50000 = m//50000
# p10000 = (m%50000)//10000
# p5000 = ((m%50000)%10000)//5000
# p1000 = (((m%50000)%10000)%5000)//1000

# print("입력한 금액은 {:,}입니다.".format(m))
# print("5만원권 지폐 : {}장".format(p50000))
# print("1만원권 지폐 : {}장".format(p10000))
# print("5천원권 지폐 : {}장".format(p5000))
# print("1천원권 지폐 : {}장".format(p1000))