# 1일차 내용 복습 - 변수, 함수
#  * 함수 사용 시 중괄호 사용 -> ex) newfunction(), print()
#  print("Hello world")-> 문자열 출력
#  print(200) -> 숫자 출력 + 사칙연산도 가능
#  print("200", 20) -> 다른 타입의 형태도 출력은 가능하나 연산은 불가함.
#  만약 다른 타입 형태를 연산하기 위해서는 형 변환(int)을 실행해야 함. 
#  %d 정수 %f 실수 %s 문자열
# print('%d %d'%(100,200)) <- 앞에는 콤마가 없어도 괄호 안에는 작성해야 함.
# print("%.2f"%(123.456789)) <- 소수점 둘째자리까지 출력
# print('%010.3f'%(12.557853)) <- 총 10자리 수를 출력, 빈칸은 0으로 채우고 소수점 셋째자리까지 표현
# format -> 중괄호 사용, 형태를 작성하기도 함. 
# print("{:.2f},{:d},{:s}".format(123.52366,456,"789"))
# \n 줄바꿈 // \t 강제 들여쓰기 + 길이가 길 때에 \ 사용해서 다음 줄에 작성 가능
# print("안녕하세요 반갑습니다. \
#     제 이름은 OOO 입니다. ")