# # 산술 연산자 - 변수 값 지정하고 결과값을 도출하는 것
# #  (+ - * /)사칙연산 + // 몫 -> 4//3=1 + % 나머지 -> 5%2=1 + ** 제곱
# # a = 1
# # b = 3
# # result1 = a//b
# # result2 = a%b
# # result3 = a**b
# # print(result1)
# # print(result2)
# # print(result3)

# # 괄호 사용 - 연산자 사용 시 괄호를 통해 순서 명확하게 해야 함. 
# # 다른 자료형으로 연산
# # str1 = '문자열'
# # n1 = 10
# # print(str1*n1)

# # 문자열이 정수나 실수일 경우 int(), float() 형태 사용해서 변환 // 문자열은 str()
# # s1 = "100"
# # s2 = "10.123"
# # print(int(s1)+float(s2))
# # 정수는 int 실수는 float으로 변환시켜야 에러 안 남. 

# # ex) 핸드폰 번호 출력
# # pn = 12341234
# # print("010"+str(pn))

# # 예제 4
# # 숫자 두 개를 입력받아 나누기값, 몫, 나머지 값을 구하시오 // n1 = 4, n2 = 2
# n1 = 4
# n2 = 2

# # # 풀이 1)
# print("나누기값: ({})".format(n1/n2),"몫: ({})".format(n1//n2),"나머지: ({})".format(n1%n2))
# # print("나누기값: ({})".format(n1/n2))
# # print("몫: ({})".format(n1//n2))
# # print("나머지: ({})".format(n1%n2))

# # # 풀이 2)
# # n1 = input("첫번째 숫자를 입력하시오 >>")
# # n1 = int(n1)
# # n2 = input("두번째 숫자를 입력하시오 >>")
# # n2 = int(n2)

# # print("나누기값: {} \n몫: {} \n나머지: {}".format(n1/n2 , n1//n2 , n1%n2))