# 조건문 - if문 if - elif - else
# a = 99
# if a < 100 :
#     print("a는 100보다 작다.")

# print("프로그램을 종료합니다.")

# # 예제 1)
# 만약 값이 바나나면 먹는다. 아니면 먹지 않는다. 
# a = "사과"
# if a == "바나나" :
#     print("먹는다.")
# else :
#     print("먹지 않는다.")
    
# # 예제 2)
# 만약 값이 10이면 10이라고 출력하고 아니면 10이 아닙니다로 출력
# num = 8
# if num == 10 :
#     print(10),
# else :
#     print('10이 아닙니다.')
    
# print("시스템을 종료합니다.")

# # 예제 3)
#  만약 100이 아니라면 100이 아닙니다로 출력
# n2 = 102
# if n2 != 100 :
#     print("100이 아닙니다.")
# else :
#     print("100이 맞습니다.")

# # 예제 4)
#  만약 n3가 10보다 크거나 같으면 [10보다 크거나 같습니다.], 아니면 [10보다 작습니다.]출력
# n3 = 19
# if n3 >= 10 :
#     print("10보다 크거나 같습니다.")
# else :
#     print("10보다 작습니다.")

